Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་འདི་དག་ལ་ནི་ཇི་ལྟར་ཡོངས་སུ་རྟོག །
en: Chapter 13: Subhūti Then the venerable Śāradvatīputra asked the venerable Subhūti, “Venerable Subhūti, when bodhisattva great beings practice the perfection of wisdom, how do they investigate these phenomena?

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་ནི་གང་།
en: Venerable Subhūti, what is a bodhisattva great being?

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་གང་།
en: What is the perfection of wisdom?

source: ཡོངས་སུ་བརྟག་པ་ནི་གང་དེ་སྐད་ཅེས་སྨྲས་པ་དང་།
en: What is that investigation?”

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: The venerable Subhūti replied to the venerable Śāradvatīputra, “Venerable Śāradvatīputra, you ask what is a bodhisattva.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གང་ཡང་འདི་སྐད་དུ་བྱང་ཆུབ་སེམས་དཔའ་གང་ཞེས་ཟེར་བ་ནི་གང་གི་ཕྱིར་སེམས་ཅན་བྱང་ཆུབ་ཡིན་པ་དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱའོ།
en: The term bodhisattva is employed because it designates a being (sattva) who is enlightened (bodhi).

source: །བྱང་ཆུབ་དེས་ཀྱང་ཆོས་ཐམས་ཅད་ཀྱི་རྣམ་པ་ཤེས་ཏེ་ཆོས་དེ་དག་ལ་མངོན་པར་ཆགས་པ་མེད་དོ།
en: It is on the basis of their enlightenment that bodhisattvas know the aspects of all phenomena, but they are without attachment to those phenomena.

source: །ཆོས་གང་གི་རྣམ་པ་ཤེས་ཤེ་ན། གཟུགས་ཀྱི་རྣམ་པ་ཤེས་ཏེ། དེ་ལ་མངོན་པར་ཆགས་པ་མེད་དོ།
en: If you ask what are the aspects of the phenomena that they know, they know the principle of physical forms, yet they are without attachment to them.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་རྣམ་པ་ཤེས་ཏེ། དེ་ལ་མངོན་པར་ཆགས་པ་མེད་དོ།
en: They know the aspects of feelings, perceptions, formative predispositions, and consciousness, yet they are without attachment to them.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་རྣམ་པ་ཤེས་ཏེ། དེ་ལ་མངོན་པར་ཆགས་པ་མེད་དོ།
en: They know the aspects of the sense fields, the sensory elements, and the links of dependent origination, yet they are without attachment to them.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཀྱི་རྣམ་པ་ཤེས་ཏེ། དེ་ལ་མངོན་པར་ཆགས་པ་མེད་དོ། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་རྣམ་པར་ཐར་བ་དང་།
en: They know the aspects of the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment, yet they are without attachment to them.

source: མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་གཟུངས་ཀྱི་སྒོ་དང་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་རྣམས་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་རྣམ་པ་ཤེས་ཏེ།
en: They know the aspects of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the eighteen distinct qualities of the buddhas, yet they are without attachment to them.” “

source: དེ་ལ་མངོན་པར་ཆགས་པ་མེད་དོ། །སྨྲས་པ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཆོས་ཐམས་ཅད་ཀྱི་རྣམ་པ་གང་ཡིན།
en: Venerable Subhūti, what are the aspects of all phenomena?” “

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་པ་གང་དང་ཚུལ་གང་དང་མཚན་མ་གང་གིས་ཆོས་རྣམས་རྣམ་པ་ཡོད་པར་བྱ་བ་སྟེ། འདི་ལྟར་འདུས་བྱས་དང་འདུས་མ་བྱས་ཀྱི་ཆོས་རྣམས་གཟུགས་སམ་སྒྲའམ་དྲིའམ་རོའམ་རེག་གམ་ཕྱི་ནང་གི་ཆོས་ཀྱང་ཤེས་ཏེ། རྣམ་པ་གང་དང་ཚུལ་གང་དང་མཚན་མ་གང་གིས་རྣམ་པར་ཡོད་པར་བྱ་བ་འདི་དག་ནི་ཆོས་ཐམས་ཅད་ཀྱི་རྣམ་པ་ཞེས་བྱའོ།
en: Venerable Śāradvatīputra,” replied Subhūti, “the aspects, characteristics, and signs whereby phenomena are shaped, and through which conditioned and unconditioned phenomena, including sights, sounds, odors, tastes, and tangibles, or external and internal phenomena, are known—these are called the aspects of all phenomena. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གང་ཡང་འདི་སྐད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཞེས་ཟེར་བ་ནི།
en: Venerable Śāradvatīputra, you also asked what is the perfection of wisdom. {

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གང་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཞེས་བྱ་བ་དེ་ནི་རིང་དུ་སོང་བ་སྟེ།
en: Dt.257} Venerable Śāradvatīputra, the expression perfection of wisdom denotes that which is far removed.

source: གང་ལས་རིང་དུ་སོང་བ་ཞེས་བྱ་ཞེ་ན། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཕུང་པོ་རྣམས་ལས་རིང་དུ་སོང་བས་ན།
en: If you ask from what it is far removed, Venerable Śāradvatīputra, it is far removed from the psycho-physical aggregates.

source: དེའི་ཕྱིར་རིང་དུ་སོང་བ་ཞེས་བྱའོ།
en: This is why it is said to be far removed.

source: །སྐྱེ་མཆེད་རྣམས་དང་། ཁམས་རྣམས་ལས་རིང་དུ་སོང་བས་ན།
en: It is far removed from the sense fields and the sensory elements.

source: །ཉོན་མོངས་པ་ཐམས་ཅད་དང་། ལྟ་བའི་རྣམ་པ་ཐམས་ཅད་དང་། འགྲོ་བ་དྲུག་ལས་རིང་དུ་སོང་བས་ན།
en: It is far removed from all afflicted mental states, from all sorts of opinions, and from the six classes of living beings.

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་རིང་དུ་སོང་བས་ན།
en: It is far removed from the perfection of generosity.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་རིང་དུ་སོང་བས་ན།
en: It is far removed from the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.

source: །ནང་སྟོང་པ་ཉིད་ལས་རིང་དུ་སོང་བས་ན།
en: It is far removed from the emptiness of internal phenomena.

source: །ཕྱི་སྟོང་པ་ཉིད་ལས་རིང་དུ་སོང་བས་ན།
en: It is far removed from the emptiness of external phenomena.

source: །ཕྱི་ནང་སྟོང་པ་ཉིད་ལས་རིང་དུ་སོང་བས་ན།
en: It is far removed from the emptiness of external and internal phenomena.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལས་རིང་དུ་སོང་བས་ན།
en: It is far removed from [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལས་རིང་དུ་སོང་བས་ན།
en: It is far removed from the applications of mindfulness.

source: དེའི་ཕྱིར་རིང་དུ་སོང་བ་ཞེས་བྱའོ། །ཡང་དག་པར་སྤོང་བ་རྣམས་དང་།
en: This is why it is said to be far removed.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལས་རིང་དུ་སོང་བས་ན།
en: It is far removed from the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path.

source: དེའི་ཕྱིར་རིང་དུ་སོང་བ་ཞེས་བྱའོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་།
en: This is why it is said to be far removed.

source: སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ལས་རིང་དུ་སོང་བས་ན། དེའི་ཕྱིར་རིང་དུ་སོང་བ་ཞེས་བྱའོ།
en: It is far removed from the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways, This is why it is said to be far removed.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལས། རིང་དུ་སོང་བས་ན།
en: It is far removed from the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge and the distinct qualities of the buddhas.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལས་རིང་དུ་སོང་བས་ན།
en: It is far removed from [the spiritual goals], up to and including all-aspect omniscience.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན། རིང་དུ་སོང་བ་སྟེ། དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: Those, Venerable Śāradvatīputra, are the formulations explaining how the perfection of wisdom is far removed. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གང་ཡང་འདི་སྐད་དུ་ཡོངས་སུ་བརྟག་པ་གང་ཞེས་ཟེར་བ་ནི།
en: Venerable Śāradvatīputra, you also asked what constitutes investigation.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། གཟུགས་རྟག་ཅེས་བྱ་བ་དང་། མི་རྟག་ཅེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: Venerable Śāradvatīputra, in this context, when bodhisattva great beings practice the perfection of wisdom, they do not investigate the notion that physical forms are permanent, or the notion that they are impermanent.

source: བདེ་ཞེས་བྱ་བ་དང་སྡུག་བསྔལ་ཞེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: They do not investigate the notion that physical forms are imbued with happiness, or the notion that they are imbued with suffering.

source: བདག་ཅེས་བྱ་བ་དང་བདག་མེད་ཅེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: They do not investigate the notion that physical forms constitute a self, or the notion that they constitute a nonself.

source: སྡུག་ཅེས་བྱ་བ་དང་མི་སྡུག་ཅེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: They do not investigate the notion that physical forms are pleasant, or the notion that they are unpleasant.

source: སྟོང་ཞེས་བྱ་བ་དང་མི་སྟོང་ཞེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: They do not investigate the notion that physical forms are empty, or the notion that they are not empty.

source: མཚན་མ་ཡོད་ཅེས་བྱ་བ་དང་། མཚན་མ་མེད་ཅེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: They do not investigate the notion that physical forms are with signs, or the notion that they are without signs.

source: སྨོན་པ་ཡོད་ཅེས་བྱ་བ་དང་། སྨོན་པ་མེད་ཅེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: They do not investigate the notion that physical forms have aspirations, or that they are without aspirations.

source: ཞི་ཞེས་བྱ་བ་དང་མ་ཞི་ཞེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: They do not investigate the notion that physical forms are at peace, or the notion that they are not at peace.

source: དབེན་ཞེས་བྱ་བ་དང་མི་དབེན་ཞེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: They do not investigate the notion that physical forms are void, or the notion that they are not void. “

source: ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་རྟག་ཅེས་བྱ་བ་དང་། མི་རྟག་ཅེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: They do not investigate the notion that feelings, perceptions, formative predispositions, and consciousness are permanent, or the notion that they are impermanent.

source: མིག་རྟག་ཅེས་བྱ་བ་དང་། མི་རྟག་ཅེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: They do not investigate the notion that the eyes are permanent, or the notion that they are impermanent.

source: མཚན་མ་ཡོད་ཅེས་བྱ་བ་དང་མཚན་མ་མེད་ཅེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: They do not investigate the notion that the eyes are with signs, or the notion that they are without signs.

source: སྨོན་པ་ཡོད་ཅེས་བྱ་བ་དང་སྨོན་པ་མེད་ཅེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: They do not investigate the notion that the eyes have aspirations, or that they are without aspirations.

source: རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་ཡིད་རྟག་ཅེས་བྱ་བ་དང་མི་རྟག་ཅེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: They do not investigate the notion that the ears, nose, tongue, body, and mental faculty are permanent, or the notion that they are impermanent.

source: གཟུགས་རྟག་ཅེས་བྱ་བ་དང་། མི་རྟག་ཅེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: They do not investigate the notion that sights are permanent, or the notion that they are impermanent.

source: སྒྲ་དང་དྲི་དང་རོ་དང་རེག་དང་ཆོས་རྟག་ཅེས་བྱ་བ་དང་མི་རྟག་ཅེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: They do not investigate the notion that sounds, odors, tastes, tangibles, and mental phenomena are permanent, or the notion that they are impermanent.

source: མིག་གི་རྣམ་པར་ཤེས་པ་རྟག་ཅེས་བྱ་བ་དང་མི་རྟག་ཅེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: They do not investigate the notion that visual consciousness is permanent, or the notion that it is impermanent.

source: རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་། སྣའི་རྣམ་པར་ཤེས་པ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་རྟག་ཅེས་བྱ་བ་དང་མི་རྟག་ཅེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: They do not investigate the notion that auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, and mental consciousness are permanent, or the notion that they are impermanent.

source: མིག་གི་འདུས་ཏེ་རེག་པ་རྟག་ཅེས་བྱ་བ་དང་མི་རྟག་ཅེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: They do not investigate the notion that visually compounded sensory contact is permanent, or the notion that it is impermanent.

source: རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་། སྣའི་འདུས་ཏེ་རེག་པ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་རྟག་ཅེས་བྱ་བ་དང་མི་རྟག་ཅེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: They do not investigate the notion that aurally compounded sensory contact, nasally compounded sensory contact, lingually compounded sensory contact, corporeally compounded sensory contact, and mentally compounded sensory contact are permanent, or the notion that they are impermanent.

source: མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྟག་ཅེས་བྱ་བ་དང་མི་རྟག་ཅེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: They do not investigate the notion that feelings due to sensory contact that is visually compounded are permanent, or the notion that they are impermanent.

source: དབེན་ཞེས་བྱ་བ་དང་མི་དབེན་ཞེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །རྣ་བའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་།
en: They do not investigate the notion that feelings due to sensory contact that is visually compounded are void, or the notion that they are not void. “

source: སྣའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྟག་ཅེས་བྱ་བ་དང་མི་རྟག་ཅེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: They do not investigate the notion that feelings due to sensory contact that is aurally compounded, feelings due to sensory contact that is nasally compounded, feelings due to sensory contact that is lingually compounded, feelings due to sensory contact that is corporeally compounded, and feelings due to sensory contact that is mentally compounded are permanent, or the notion that they are impermanent.

source: སའི་ཁམས་རྟག་ཅེས་བྱ་བ་དང་མི་རྟག་ཅེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: They do not investigate the notion that the earth element is permanent, or the notion that it is impermanent.

source: ཆུའི་ཁམས་དང་མེའི་ཁམས་དང་རླུང་གི་ཁམས་དང་། ནམ་མཁའི་ཁམས་དང་རྣམ་པར་ཤེས་པའི་ཁམས་རྟག་ཅེས་བྱ་བ་དང་མི་རྟག་ཅེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: They do not investigate the notion that the water element, the fire element, the wind element, the space element, and the consciousness element are permanent or the notion that they are impermanent.

source: མ་རིག་པ་རྟག་ཅེས་བྱ་བ་དང་མི་རྟག་ཅེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: They do not investigate the notion that ignorance is permanent, or the notion that it is impermanent.

source: འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་དང་མིང་དང་གཟུགས་དང་སྐྱེ་མཆེད་དྲུག་དང་རེག་པ་དང་ཚོར་བ་དང་། སྲེད་པ་དང་ལེན་པ་དང་སྲིད་པ་དང་སྐྱེ་བ་དང་རྒ་ཤི་རྟག་ཅེས་བྱ་བ་དང་མི་རྟག་ཅེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: They do not investigate the notion that formative predispositions, consciousness, name and form, the six sense fields, sensory contact, sensation, craving, grasping, the rebirth process, actual birth, and aging and death are permanent, or the notion that they are impermanent.

source: སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྟག་ཅེས་བྱ་བ་དང་མི་རྟག་ཅེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: They do not investigate the notion that the perfection of generosity is permanent, or the notion that it is impermanent.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྟག་ཅེས་བྱ་བ་དང་མི་རྟག་ཅེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: They do not investigate the notion that the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom are permanent, or the notion that they are impermanent.

source: ནང་སྟོང་པ་ཉིད་རྟག་ཅེས་བྱ་བ་དང་མི་རྟག་ཅེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: They do not investigate the notion that the emptiness of internal phenomena is permanent, or the notion that it is impermanent.

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་རྟག་ཅེས་བྱ་བ་དང་མི་རྟག་ཅེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: They do not investigate the notion that [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are permanent, or the notion that they are impermanent.

source: དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་རྟག་ཅེས་བྱ་བ་དང་མི་རྟག་ཅེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: They do not investigate the notion that the applications of mindfulness are permanent, or the notion that they are impermanent.

source: དབེན་ཞེས་བྱ་བ་དང་མི་དབེན་ཞེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །ཡང་དག་པར་སྤོང་བ་རྣམས་དང་།
en: They do not investigate the notion that the applications of mindfulness are void, or the notion that they are not void. “

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་རྟག་ཅེས་བྱ་བ་དང་མི་རྟག་ཅེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: They do not investigate the notion that the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path are permanent, or the notion that they are impermanent.

source: དབེན་ཞེས་བྱ་བ་དང་མི་དབེན་ཞེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་།
en: They do not investigate the notion that these causal attributes are void, or the notion that they are not void. “

source: རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་།
en: They do not investigate the notion that the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the distinct qualities of the buddhas are permanent, or the notion that they are impermanent.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་རྟག་ཅེས་བྱ་བ་དང་མི་རྟག་ཅེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །བདེ་ཞེས་བྱ་བ་དང་སྡུག་བསྔལ་ཞེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: They do not investigate the notion that these fruitional attributes are imbued with happiness, or the notion that they are imbued with suffering.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་རྟག་ཅེས་བྱ་བ་དང་མི་རྟག་ཅེས་བྱ་བར་ཡོངས་སུ་མི་རྟོག་གོ །
en: They do not investigate the notion that [the spiritual goals], up to and including all-aspect omniscience, are permanent, or the notion that they are impermanent.

source: འདི་ལྟ་སྟེ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་འདི་དག་ལ་ཡོངས་སུ་རྟོག་པ་མེད་པའི་ཚུལ་གྱིས་དེ་ལྟར་ཡོངས་སུ་རྟོག་གོ །
en: So it is, Venerable Śāradvatīputra, that when bodhisattva great beings practice the perfection of wisdom, they investigate those phenomena in that noninvestigative manner.”

source: སྨྲས་པ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཅིའི་ཕྱིར་ན་དེ་སྐད་དུ་གཟུགས་ཀྱི་མ་སྐྱེས་པ་གང་ཡིན་པ་དེ་ནི་གཟུགས་མ་ཡིན། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པའི་མ་སྐྱེས་པ་གང་ཡིན་པ་དེ་ནི་རྣམ་པར་ཤེས་པ་མ་ཡིན་ཞེས་ཟེར། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཅིའི་ཕྱིར་ན། དེ་སྐད་དུ་སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཐམས་ཅད་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་བ་རྣམས་དང་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་།
en: The venerable Śāradvatīputra asked, “Venerable Subhūti, why do you say that the nonarising of physical forms is not physical forms, and that the nonarising of feelings, perceptions, formative predispositions, and consciousness is not consciousness [and so forth]?

source: རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་།
en: Venerable Subhūti, why do you say that the nonarising of the sense fields, the sensory elements, the links of dependent origination, the perfections, all the aspects of emptiness, all the factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, {Dt.258} the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, the distinct qualities of the buddhas, and all-aspect omniscience is not all-aspect omniscience [and so forth]?” “

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་མ་སྐྱེས་པ་གང་ཡིན་པ་དེ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མ་ཡིན་ཞེས་ཟེར། རབ་འབྱོར་གྱིས་སྨྲས་པ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཟུགས་ནི་གཟུགས་ཀྱིས་སྟོང་སྟེ།
en: Venerable Śāradvatīputra,” replied Subhūti, “physical forms are empty of physical forms.

source: གང་སྟོང་པ་དེ་ནི་གཟུགས་མ་ཡིན་ཏེ། སྐྱེ་བ་མེད་དོ།
en: That which is empty is not physical forms, nor does it arise.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན། གཟུགས་ཀྱི་མ་སྐྱེས་པ་གང་ཡིན་པ་དེ་ནི་གཟུགས་མ་ཡིན་ནོ།
en: That, Venerable Śāradvatīputra, is the formulation explaining how the nonarising of physical forms is not physical forms.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ནི་རྣམ་པར་ཤེས་པས་སྟོང་སྟེ།
en: Venerable Śāradvatīputra, feelings, perceptions, formative predispositions, and consciousness are empty of consciousness [and so forth].

source: གང་སྟོང་པ་དེ་ནི་རྣམ་པར་ཤེས་པ་མ་ཡིན་ཏེ་སྐྱེ་བ་མེད་དོ།
en: That which is empty is not consciousness [and so forth], nor does it arise.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན། རྣམ་པར་ཤེས་པའི་མ་སྐྱེས་པ་གང་ཡིན་པ་དེ་རྣམ་པར་ཤེས་པ་མ་ཡིན་ནོ།
en: That, Venerable Śāradvatīputra, is the formulation explaining how the nonarising of consciousness [and so forth] is not consciousness [and so forth]. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ནི་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བས་སྟོང་སྟེ།
en: Venerable Śāradvatīputra, the sense fields, the sensory elements, and the links of dependent origination are empty of the links of dependent origination [and so forth].

source: གང་སྟོང་བ་དེ་ནི་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་མ་ཡིན་ཏེ་སྐྱེ་བ་མེད་དོ།
en: That which is empty is not the links of dependent origination [and so forth], nor does it arise.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་མ་སྐྱེས་པ་གང་ཡིན་པ་དེ་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་མ་ཡིན་ནོ།
en: That, Venerable Śāradvatīputra, is the formulation explaining how the nonarising of the links of dependent origination [and so forth] is not the links of dependent origination [and so forth]. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པས་སྟོང་སྟེ།
en: Venerable Śāradvatīputra, the perfection of generosity is empty of the perfection of generosity.
